In [1]:
import pandas as pd

### Задание 1

In [3]:
# https://grouplens.org/datasets/movielens/

# считываем скаченный файл
ratings = pd.read_csv('/Users/larisatelukh/Documents/Product_Analytics/Python/ml-latest-small/ratings.csv')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [43]:
# Определение, какому фильму было выставлено больше всего оценок 5.0

ratings[ ratings.rating == 5.0 ].groupby(['movieId']).count().sort_values('rating', ascending=False).head(1)

         userId  rating  timestamp
movieId
318         153     153        153

In [40]:
# проверка количества оценок 5.0

len(ratings[(ratings.movieId == 318) & (ratings.rating == 5.0)])

153

### Задание 2

In [46]:
# Считываем файл power.csv

data = pd.read_csv('/Users/larisatelukh/Documents/Product_Analytics/Python/10/power.csv')

data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [64]:
# Выбираем данные по странам Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года

filtered_countries = data[ (data['country'].isin(['Latvia','Lithuania', 'Estonia'])) & (data['category'].isin([4, 12, 21])) & (data['year'].isin([2005,2006,2007,2008,2009,2010]) & (data['quantity'] > 0))]

filtered_countries.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4
11158  Lithuania  2006       1.0         4
11159  Lithuania  2005       1.0         4

In [65]:
# считаем суммарное потребление по этим странам

filtered_countries['quantity'].sum()

240580.0

### Задание 3

In [69]:
# Импортируем таблицу в pandas dataframe, на сайте class = 'table lh2'

page_url = 'https://www.fussballdaten.de'


df = pd.read_html(page_url, attrs = {'class': 'table lh2'})

In [70]:
df[:5]

[    Unnamed: 0  Pl.     Mannschaft  Sp.  S  U  V   Tore  Diff.  Pkt
 0          NaN    1        Hamburg    8  5  2  1  17:11      6   17
 1          NaN    2          Fürth    8  4  3  1   16:8      8   15
 2          NaN    3      Paderborn    8  4  2  2   14:7      7   14
 3          NaN    4     VfL Bochum    8  4  2  2   12:9      3   14
 4          NaN    5  Holstein Kiel    8  3  4  1   10:8      2   13
 5          NaN    6      Osnabrück    8  3  4  1  12:11      1   13
 6          NaN    7            Aue    8  3  3  2   10:8      2   12
 7          NaN    8     Düsseldorf    8  3  2  3   8:10     -2   11
 8          NaN    9      Karlsruhe    8  3  1  4  13:10      3   10
 9          NaN   10       Nürnberg    8  2  4  2  14:12      2   10
 10         NaN   11       Hannover    8  3  1  4  12:10      2   10
 11         NaN   12     Heidenheim    8  2  3  3  12:11      1    9
 12         NaN   13     Regensburg    8  2  3  3  11:13     -2    9
 13         NaN   14      Darmstadt    8  2  3  3  12:18     -6    9
 14         NaN   15     Sandhausen    8  2  2  4   8:12     -4    8
 15         NaN   16   Braunschweig    8  2  2  4   9:17     -8    8
 16         NaN   17      St. Pauli    8  1  4  3  12:16     -4    7
 17         NaN   18    K. Würzburg    8  1  1  6   8:19    -11    4]